/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   helper_for_work.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: idunaver <idunaver@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/27 21:30:23 by idunaver          #+#    #+#             */
/*   Updated: 2019/12/27 21:34:42 by idunaver         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 
* Просто для помощи и проверки,
* к функциональности проекта не относится.
*/

#include "asm.h"

void		what_are_tokens(t_token *token) {
	while (token != NULL) {
		printf("token:%s\n", token->content);
		token = token->next;
	}
}
